renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA4L1BD.h
            struct
            {
                __IM uint32_t CFCCNT : 16; /*!< [15..0] CTSU CFC Counter                                                  */
                uint32_t             : 16;
            } CTSUCFCCNT_b;
        };
        __IM uint16_t CTSUCFCCNTL;         /*!< (@ 0x00000034) CTSU CFC Counter Register                                  */
    };
    __IM uint32_t RESERVED1[2];

    union
    {
        union
        {
            __IOM uint32_t CTSUOPT;          /*!< (@ 0x00000040) CTSU Option Setting Register                               */

            struct
            {
                __IOM uint32_t CCOCFEN  : 1; /*!< [0..0] CCO Characteristics Correction Function Enable                     */
                __IOM uint32_t MCACEFN  : 1; /*!< [1..1] Multi-clock Correction Function Enable                             */
                __IOM uint32_t MAJIRIMD : 1; /*!< [2..2] Majority Mode                                                      */
                uint32_t                : 1;
                __IOM uint32_t DTCLESS  : 1; /*!< [4..4] Data Transfer Request Disable                                      */
                __IOM uint32_t MTUCFEN  : 1; /*!< [5..5] 5 MTUCFEN Mutual Capacitance Calculation Enable                    */
                uint32_t                : 2;
                __IOM uint32_t AJFEN    : 1; /*!< [8..8] Automatic Judgment Function Enable                                 */
                __IOM uint32_t AJINTC   : 1; /*!< [9..9] Automatic Judgment Interrupt Control                               */
                uint32_t                : 6;
                __IOM uint32_t SCACTB   : 4; /*!< [19..16] Sensor Counter Automatic Correction Table Number Setting         */
                uint32_t                : 12;
            } CTSUOPT_b;
        };

        struct
        {
            union
            {
                __IOM uint16_t CTSUOPTL; /*!< (@ 0x00000040) CTSU Option Setting Register                               */

                struct
                {
                    union
                    {
                        __IOM uint8_t AC;               /*!< (@ 0x00000040) CTSU Option Setting Register                               */

                        struct
                        {
                            __IOM uint8_t CCOCFEN  : 1; /*!< [0..0] CCO Characteristics Correction Function Enable                     */
                            __IOM uint8_t MCACEFN  : 1; /*!< [1..1] Multi-clock Correction Function Enable                             */
                            __IOM uint8_t MAJIRIMD : 1; /*!< [2..2] Majority Mode                                                      */
                            uint8_t                : 1;
                            __IOM uint8_t DTCLESS  : 1; /*!< [4..4] Data Transfer Request Disable                                      */
                            __IOM uint8_t MTUCFEN  : 1; /*!< [5..5] Mutual Capacitance Calculation Enable                              */
                            uint8_t                : 2;
                        } AC_b;
                    };

                    union
                    {
                        __IOM uint8_t AJ;             /*!< (@ 0x00000041) CTSU Option Setting Register                               */

                        struct
                        {
                            __IOM uint8_t AJFEN  : 1; /*!< [0..0] Automatic Judgment Function Enable                                 */
                            __IOM uint8_t AJINTC : 1; /*!< [1..1] Automatic Judgment Interrupt Control                               */
                            uint8_t              : 6;
                        } AJ_b;
                    };
                };
            };

            union
            {
                __IOM uint16_t CTSUOPTH;          /*!< (@ 0x00000042) CTSU Option Setting Register                               */

                union
                {
                    __IOM uint8_t ACTB;           /*!< (@ 0x00000042) CTSU Option Setting Register                               */

                    struct
                    {
                        __IOM uint8_t SCACTB : 4; /*!< [3..0] Sensor Counter Automatic Correction Table Number Setting           */
                        uint8_t              : 4;
                    } ACTB_b;
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUSCNTACT;          /*!< (@ 0x00000044) CTSU Sensor Counter Automatic Correction Table
                                                  *                  Access Register                                            */

            struct
            {
                __IOM uint32_t SCNTACCOEFF : 16; /*!< [15..0] Sensor Counter Correction Coefficient Setting                     */
                __IOM uint32_t SCNTACCOUNT : 16; /*!< [31..16] Set the measurement value to be compared                         */
            } CTSUSCNTACT_b;
        };

        struct
        {
            __IOM uint16_t CTSUSCNTACTL; /*!< (@ 0x00000044) CTSU Option Setting Register                               */
            __IOM uint16_t CTSUSCNTACTH; /*!< (@ 0x00000046) CTSU Option Setting Register                               */
        };
    };
    __IM uint32_t RESERVED2;

    union
    {
        union
        {
            __IOM uint32_t CTSUMACT1;            /*!< (@ 0x0000004C) Multi-Clock Automatic Correction Table Access
                                                  *                  Register                                                   */

            struct
            {
                __IOM uint32_t SO          : 10; /*!< [9..0] Sensor offset adjustment bits for multi-clock                      */
                uint32_t                   : 6;
                __IOM uint32_t OFFSETCOEFF : 16; /*!< [31..16] Offset coefficient bits for multi-clock                          */
            } CTSUMACT1_b;
        };

        struct
        {
            __IOM uint16_t CTSUMACT1L; /*!< (@ 0x0000004C) CTSU Option Setting Register                               */
            __IOM uint16_t CTSUMACT1H; /*!< (@ 0x0000004E) CTSU Option Setting Register                               */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUMACT2;            /*!< (@ 0x00000050) Multi-Clock Automatic Correction Table Access
                                                  *                  Register                                                   */

            struct
            {
                __IOM uint32_t SO          : 10; /*!< [9..0] Sensor offset adjustment bits for multi-clock                      */
                uint32_t                   : 6;
                __IOM uint32_t OFFSETCOEFF : 16; /*!< [31..16] Offset coefficient bits for multi-clock                          */
            } CTSUMACT2_b;
        };

        struct
        {
            __IOM uint16_t CTSUMACT2L; /*!< (@ 0x00000050) CTSU Option Setting Register                               */
            __IOM uint16_t CTSUMACT2H; /*!< (@ 0x00000052) CTSU Option Setting Register                               */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUMACT3;            /*!< (@ 0x00000054) Multi-Clock Automatic Correction Table Access
                                                  *                  Register                                                   */

            struct
            {
                __IOM uint32_t SO          : 10; /*!< [9..0] Sensor offset adjustment bits for multi-clock                      */
                uint32_t                   : 6;
                __IOM uint32_t OFFSETCOEFF : 16; /*!< [31..16] Offset coefficient bits for multi-clock                          */
            } CTSUMACT3_b;
        };

        struct
        {
            __IOM uint16_t CTSUMACT3L; /*!< (@ 0x00000054) CTSU Option Setting Register                               */
            __IOM uint16_t CTSUMACT3H; /*!< (@ 0x00000056) CTSU Option Setting Register                               */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJCR;       /*!< (@ 0x00000058) CTSU Automatic Judgment Control Registe                    */

            struct
            {
                __IOM uint32_t TLOT   : 8; /*!< [7..0] Non-Touch Judgment Criterion Setting                               */
                __IOM uint32_t THOT   : 8; /*!< [15..8] Touch Judgment Criterion Setting                                  */
                __IOM uint32_t BLINI  : 1; /*!< [16..16] Baseline Initialization                                          */
                uint32_t              : 3;
                __IOM uint32_t JC     : 2; /*!< [21..20] Judgment Condition Setting                                       */
                uint32_t              : 2;
                __IOM uint32_t AJMMAT : 4; /*!< [27..24] Measured Value Moving Average Number Setting                     */
                __IOM uint32_t AJBMAT : 4; /*!< [31..28] Baseline Average Number Setting                                  */
            } CTSUAJCR_b;
        };

        struct
        {
            union
            {
                __IOM uint16_t CTSUAJCRL; /*!< (@ 0x00000058) CTSU Automatic Judgment Control Register                   */

                struct
                {
                    union
                    {
                        __IOM uint8_t AJCR0;        /*!< (@ 0x00000058) CTSU Automatic Judgment Control Register                   */

                        struct
                        {
                            __IOM uint8_t TLOT : 8; /*!< [7..0] Non-Touch Judgment Criterion Setting                               */
                        } AJCR0_b;
                    };

                    union
                    {
                        __IOM uint8_t AJCR1;        /*!< (@ 0x00000059) CTSU Automatic Judgment Control Register                   */

                        struct
                        {
                            __IOM uint8_t THOT : 8; /*!< [7..0] Touch Judgment Criterion Setting                                   */
                        } AJCR1_b;
                    };
                };
            };

            union
            {
                __IOM uint16_t CTSUAJCRH; /*!< (@ 0x0000005A) CTSU Automatic Judgment Control Register                   */

                struct
                {
                    union
                    {
                        __IOM uint8_t AJCR2;         /*!< (@ 0x0000005A) CTSU Automatic Judgment Control Register                   */

                        struct
                        {
                            __IOM uint8_t BLINI : 1; /*!< [0..0] Baseline Initialization                                            */
                            uint8_t             : 3;
                            __IOM uint8_t JC    : 2; /*!< [5..4] Judgment Condition Setting                                         */
                            uint8_t             : 2;
                        } AJCR2_b;
                    };

                    union
                    {
                        __IOM uint8_t AJCR3;          /*!< (@ 0x0000005B) CTSU Automatic Judgment Control Register                   */

                        struct
                        {
                            __IOM uint8_t AJMMAT : 4; /*!< [3..0] Measured Value Moving Average Number Setting                       */
                            __IOM uint8_t AJBMAT : 4; /*!< [7..4] Baseline Average Number Setting                                    */
                        } AJCR3_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJTHR;      /*!< (@ 0x0000005C) CTSU Automatic Judgment Control Register                   */

            struct
            {
                __IOM uint32_t AJTHL : 16; /*!< [15..0] Lower Threshold Setting                                           */
                __IOM uint32_t AJTHH : 16; /*!< [31..16] Upper Threshold Setting                                          */
            } CTSUAJTHR_b;
        };

        struct
        {
            __IOM uint16_t CTSUAJTHRL; /*!< (@ 0x0000005C) CTSU Automatic Judgment Control Register                   */
            __IOM uint16_t CTSUAJTHRH; /*!< (@ 0x0000005E) CTSU Automatic Judgment Control Register                   */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJMMAR;       /*!< (@ 0x00000060) CTSU Threshold Register                                    */

            struct
            {
                __IOM uint32_t AJMMATI : 4;  /*!< [3..0] Moving Average Count                                               */
                uint32_t               : 1;
                __IOM uint32_t AJMMR   : 27; /*!< [31..5] Moving Average Result                                             */
            } CTSUAJMMAR_b;
        };

        struct
        {
            __IOM uint16_t CTSUAJMMARL; /*!< (@ 0x00000060) CTSU Threshold Register                                    */
            __IOM uint16_t CTSUAJMMARH; /*!< (@ 0x00000062) CTSU Threshold Register                                    */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJBLACT;      /*!< (@ 0x00000064) CTSU Baseline Average Intermediate Result Register         */

            struct
            {
                __IOM uint32_t AJBLACT : 32; /*!< [31..0] Automatic determination baseline average calculation
                                              *   bits                                                                      */
            } CTSUAJBLACT_b;
        };

        struct
        {
            __IOM uint16_t CTSUAJBLACTL; /*!< (@ 0x00000064) CTSU Baseline Average Intermediate Result Register         */
            __IOM uint16_t CTSUAJBLACTH; /*!< (@ 0x00000066) CTSU Baseline Average Intermediate Result Register         */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJBLAR;      /*!< (@ 0x00000068) CTSU Baseline Average Result Register                      */

            struct
            {
                __IOM uint32_t AJBLAC : 16; /*!< [15..0] Baseline Average Count                                            */
                __IOM uint32_t AJBLAR : 16; /*!< [31..16] Baseline Average Result                                          */
            } CTSUAJBLAR_b;
        };

        struct
        {
            __IOM uint16_t CTSUAJBLARL; /*!< (@ 0x00000068) CTSU Baseline Average Result Register                      */
            __IOM uint16_t CTSUAJBLARH; /*!< (@ 0x0000006A) CTSU Baseline Average Result Register                      */
        };
    };

    union
    {
        union
        {
            __IOM uint32_t CTSUAJRR;      /*!< (@ 0x0000006C) CTSU Automatic Judgment Result Register                    */

            struct
            {
                __IOM uint32_t TJR0 : 1;  /*!< [0..0] The judgment result when using SUCLK0 is stored.                   */
                __IOM uint32_t TJR1 : 1;  /*!< [1..1] The judgment result when using SUCLK1 is stored.                   */
                __IOM uint32_t TJR2 : 1;  /*!< [2..2] The judgment result when using SUCLK2 is stored.                   */
                __IOM uint32_t TJR3 : 1;  /*!< [3..3] The judgment result when using SUCLK3 is stored.                   */
                __IOM uint32_t FJR  : 1;  /*!< [4..4] The final judgment result on multi-clock measurement
                                           *   is stored.                                                                */
                uint32_t             : 3;
                __IOM uint32_t SJCCR : 8; /*!< [15..8] Remaining Number of Consecutive Detections                        */
                uint32_t             : 16;
            } CTSUAJRR_b;
        };
        __IOM uint16_t CTSUAJRRL;         /*!< (@ 0x0000006C) CTSU Automatic Judgment Result Register                    */

        struct
        {
            __IOM uint8_t CTSUAJRR0;      /*!< (@ 0x0000006C) CTSU Automatic Judgment Result Register                    */
            __IOM uint8_t CTSUAJRR1;      /*!< (@ 0x0000006D) CTSU Automatic Judgment Result Register                    */
        };
    };
} R_CTSU2_Type;                           /*!< Size = 112 (0x70)                                                         */

/* =========================================================================================================================== */
/* ================                                           R_DAC                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief D/A Converter (R_DAC)
 */

typedef struct                         /*!< (@ 0x40171000) R_DAC Structure                                            */
{
    union
    {
        __IOM uint16_t DADR[2];        /*!< (@ 0x00000000) D/A Data Register                                          */

        struct
        {
            __IOM uint16_t DADR : 16;  /*!< [15..0] D/A Data RegisterNOTE: When DADPR.DPSEL = 0, the high-order
                                        *   4 bits are fixed to 0: right justified format. When DADPR.DPSEL
                                        *   = 1, the low-order 4 bits are fixed to 0: left justified
                                        *   format.                                                                   */
        } DADR_b[2];
    };

    union
    {
        __IOM uint8_t DACR;            /*!< (@ 0x00000004) D/A Control Register                                       */

        struct
        {
            uint8_t             : 5;
            __IOM uint8_t DAE   : 1;   /*!< [5..5] D/A Enable                                                         */
            __IOM uint8_t DAOE0 : 1;   /*!< [6..6] D/A Output Enable 0                                                */
            __IOM uint8_t DAOE1 : 1;   /*!< [7..7] D/A Output Enable 0                                                */
        } DACR_b;
    };

    union
    {
        __IOM uint8_t DADPR;           /*!< (@ 0x00000005) DADR0 Format Select Register                               */

        struct
        {
            uint8_t             : 7;
            __IOM uint8_t DPSEL : 1;   /*!< [7..7] DADRm Format Select                                                */
        } DADPR_b;
    };

    union
    {
        __IOM uint8_t DAADSCR;         /*!< (@ 0x00000006) D/A-A/D Synchronous Start Control Register                 */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t DAADST : 1;  /*!< [7..7] D/A-A/D Synchronous Conversion                                     */
        } DAADSCR_b;
    };

    union
    {
        __IOM uint8_t DAVREFCR;        /*!< (@ 0x00000007) D/A VREF Control Register                                  */

        struct
        {
            __IOM uint8_t REF : 3;     /*!< [2..0] D/A Reference Voltage Select                                       */
            uint8_t           : 5;
        } DAVREFCR_b;
    };

    union
    {
        __IOM uint8_t DAAMPCR;         /*!< (@ 0x00000008) D/A Output Amplifier Control Register                      */

        struct
        {
            uint8_t              : 6;
            __IOM uint8_t DAAMP0 : 1;  /*!< [6..6] Amplifier Control                                                  */
            __IOM uint8_t DAAMP1 : 1;  /*!< [7..7] Amplifier Control                                                  */
        } DAAMPCR_b;
    };

    union
    {
        __IOM uint8_t DAPC;            /*!< (@ 0x00000009) D/A Switch Charge Pump Control Register                    */

        struct
        {
            __IOM uint8_t PUMPEN : 1;  /*!< [0..0] Charge Pump Enable                                                 */
            uint8_t              : 7;
        } DAPC_b;
    };
    __IM uint16_t RESERVED[9];

    union
    {
        __IOM uint8_t DAASWCR;         /*!< (@ 0x0000001C) D/A Amplifier Stabilization Wait Control Register          */

        struct
        {
            uint8_t              : 6;
            __IOM uint8_t DAASW0 : 1;  /*!< [6..6] Set the DAASW0 bit to 1 in the initialization procedure
                                        *   to wait for stabilization of the output amplifier of D/A
                                        *   channel 0. When DAASW0 is set to 1, D/A conversion operates,
                                        *   but the conversion result D/A is not output from channel
                                        *   0. When the DAASW0 bit is 0, the stabilization wait time
                                        *   stops, and the D/A conversion result of channel 0 is output
                                        *   through the output amplifier.                                             */
            __IOM uint8_t DAASW1 : 1;  /*!< [7..7] Set the DAASW1 bit to 1 in the initialization procedure
                                        *   to wait for stabilization of the output amplifier of D/A
                                        *   channel 1. When DAASW1 is set to 1, D/A conversion operates,
                                        *   but the conversion result D/A is not output from channel
                                        *   1. When the DAASW1 bit is 0, the stabilization wait time
                                        *   stops, and the D/A conversion result of channel 1 is output
                                        *   through the output amplifier.                                             */
        } DAASWCR_b;
    };
    __IM uint8_t  RESERVED1;
    __IM uint16_t RESERVED2[2129];

    union
    {
        __IOM uint8_t DAADUSR;          /*!< (@ 0x000010C0) D/A A/D Synchronous Unit Select Register                   */

